<template>
  <div>
    <app-header></app-header>
    <div class="content-app">
      <div class="container">
        <breadcrumbs :link="link"></breadcrumbs>
        <div class="section-ttl left">Услуги</div>
        <div class="list-services">
          <div class="item" v-for="service of services">

            <div class="item-text">
              <h2>{{ service.name }}</h2>
              <p>{{ service.descr }}</p>
              <div class="btn"><span>Перейти</span></div>
            </div>
            <div class="item-img">
              <img :src="service.logo" :alt="service.name">
            </div>
          </div>
        </div>
      </div>
    </div>
    <ask></ask>
    <app-footer></app-footer>
  </div>

</template>

<script>
  import Breadcrumbs from '@/components/Breadcrumbs'
  import Ask from '@/components/Ask'
  import image1 from '../assets/images/services/service-1.jpg'
  import image2 from '../assets/images/services/service-2.jpg'
  import image3 from '../assets/images/services/service-3.jpg'
  import image4 from '../assets/images/services/service-4.jpg'
  import image5 from '../assets/images/services/service-5.jpg'
  import image6 from '../assets/images/services/service-6.jpg'
  import image7 from '../assets/images/services/service-7.jpg'

  export default {
    data() {
      return {
        link: 'Услуги',
        services: [
          {
            logo: image1,
            name: 'Чип-тюнинг',
            descr: 'Программное увеличение мощности и крутящего момента двигателя. Процедуру чип-тюнинга можно разделить на три этапа: cчитывание заводской программы из электронного блока управления, коррекция считанной программы и изменение контрольных чисел в ней, запись откорректированной программы в контроллер. Чтение и запись измененной '
          },
          {
            logo: image2,
            name: 'Оборудование для чип-тюнинга',
            descr: 'Программное увеличение мощности и крутящего момента двигателя. Процедуру чип-тюнинга можно разделить на три этапа: cчитывание заводской программы из электронного блока управления, коррекция считанной программы и изменение контрольных чисел в ней, запись откорректированной программы в контроллер. Чтение и запись измененной '
          },
          {
            logo: image3,
            name: 'Тюнинг / Стайлинг / Комплектующие',
            descr: 'Программное увеличение мощности и крутящего момента двигателя. Процедуру чип-тюнинга можно разделить на три этапа: cчитывание заводской программы из электронного блока управления, коррекция считанной программы и изменение контрольных чисел в ней, запись откорректированной программы в контроллер. Чтение и запись измененной '
          },
          {
            logo: image4,
            name: 'Дооснащения / Защита от угона',
            descr: 'Программное увеличение мощности и крутящего момента двигателя. Процедуру чип-тюнинга можно разделить на три этапа: cчитывание заводской программы из электронного блока управления, коррекция считанной программы и изменение контрольных чисел в ней, запись откорректированной программы в контроллер. Чтение и запись измененной '
          },
          {
            logo: image5,
            name: 'Детейлинг / Винил / Аэрография',
            descr: 'Программное увеличение мощности и крутящего момента двигателя. Процедуру чип-тюнинга можно разделить на три этапа: cчитывание заводской программы из электронного блока управления, коррекция считанной программы и изменение контрольных чисел в ней, запись откорректированной программы в контроллер. Чтение и запись измененной '
          },
          {
            logo: image6,
            name: 'Замер мощности на диностенде',
            descr: 'Программное увеличение мощности и крутящего момента двигателя. Процедуру чип-тюнинга можно разделить на три этапа: cчитывание заводской программы из электронного блока управления, коррекция считанной программы и изменение контрольных чисел в ней, запись откорректированной программы в контроллер. Чтение и запись измененной '
          },
          {
            logo: image7,
            name: 'Обслуживание и ремонт',
            descr: 'Программное увеличение мощности и крутящего момента двигателя. Процедуру чип-тюнинга можно разделить на три этапа: cчитывание заводской программы из электронного блока управления, коррекция считанной программы и изменение контрольных чисел в ней, запись откорректированной программы в контроллер. Чтение и запись измененной '
          }
        ]
      }
    },
    components: {
      Breadcrumbs,
      Ask
    }
  }
</script>

<style scoped>

</style>